app/controllers/course_controller.rb

SELECT `courses`.* FROM `courses` ORDER BY position ASC
---
  def index
  	@courses = Course.all

INSERT INTO `courses` (`title`, `coursename`, `description`, `courseoutline`, `created_at`, `updated_at`) VALUES ('CEH', 'Certified Ethical Hacker (CEH)', 'SECURITY COURSE', 'FOOTPRINTING', '2021-05-24 09:37:07.279749', '2021-05-24 09:37:07.279749')
---
  def create
  	@course = Course.new(my_params)
  	if @course.save

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 6 LIMIT 1
---
  def show
  	@course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 6 LIMIT 1
---
  def delete
  	@course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 6 LIMIT 1
DELETE FROM `courses` WHERE `courses`.`id` = 6
---
  def destroy
  		@course = Course.find(params[:id])
  		@course.destroy